#include <iostream>
#include <vector>

struct Command
{
    std::string name;
    std::string description;

    void (*handler)(const std::vector<std::string>&);
};

int main()
{
    std::string banner = R"(
    ========================================
████████╗██╗███╗   ██╗██╗   ██╗██╗   ██╗███╗   ███╗
╚══██╔══╝██║████╗  ██║╚██╗ ██╔╝██║   ██║████╗ ████║
   ██║   ██║██╔██╗ ██║ ╚████╔╝ ██║   ██║██╔████╔██║
   ██║   ██║██║╚██╗██║  ╚██╔╝  ╚██╗ ██╔╝██║╚██╔╝██║
   ██║   ██║██║ ╚████║   ██║    ╚████╔╝ ██║ ╚═╝ ██║
   ╚═╝   ╚═╝╚═╝  ╚═══╝   ╚═╝     ╚═══╝  ╚═╝     ╚═╝

              TinyVM Shell v0.1

    ========================================
    )";

    std::cout << banner << std::endl;

    while (true)
    {
        
    }
}